//要求：n=2^k个运动员进行网络循环赛。
//每个选手必须与其它选手各赛一次
//每个选手一天只能赛一次
//循环赛一共进行n-1天

void Table(int k,int** a)
{

    int n=(1<<k);//求出运动员总数

    //第一列给出运动员的编号
    for(int i=1; i<=n; i++)
        a[1][i]=i;


    int m=1;
    for(int s=1; s<=k; s++)              //给出总的二分次数，k次。
    {
        n/=2;                                //将n个运动员进行二分

        for(int t=1; t<=n; t++)                                 //总共n个运动员
            for(int i=m+1; i<=2*m; i++)
                for(int j=m+1; j<=2*m; j++)
                {
                    a[i][j+(t-1)*m*2]=a[i-m][j+(t-1)*m*2-m];
                    a[i][j+(t-1)*m*2-m]=a[i-m][j+(t-1)*m*2];
                }
        m*=2;
    }

}
